artillery_performance/ChangeToComplete.yml
config:
  target: "https://api.todoist.com"
  phases:
    - duration: 1
      arrivalRate: 1
      name: "Change Task Status to Complete"
  defaults:
    headers:
      Authorization: Bearer 27698838c9e21df1aea4e5bd28a722c50b738097  #{{ $processEnvironment.token }}
      Content-Type: application/json
  variables:
    url_tasks:
      - "/rest/v1/tasks"
    task_name:
      - "My task is complete"
scenarios:
  - name: "complete a Task"
    flow:
    - post:
        url: "{{ url_tasks }}"
        json:
          content: "{{ task_name }}"
        capture:
          json: "$.id"
          as: "id_task"
    - log: "task name '{{ task_name }}' task id: {{ id_task }}"
    - post: 
        url: "{{ url_tasks }}/{{ id_task }}/close"